/*
SQLyog v10.2 
MySQL - 5.5.53 : Database - mental_health
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`mental_health` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `mental_health`;

/*Table structure for table `ci_access` */

DROP TABLE IF EXISTS `ci_access`;

CREATE TABLE `ci_access` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `r_id` int(11) DEFAULT NULL,
  `n_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `r_id` (`r_id`) USING BTREE,
  KEY `n_id` (`n_id`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=951 DEFAULT CHARSET=utf8;

/*Data for the table `ci_access` */

insert  into `ci_access`(`id`,`r_id`,`n_id`) values (910,1,18),(482,2,7),(481,2,5),(480,2,6),(479,2,2),(478,2,1),(909,1,17),(908,1,21),(907,1,16),(906,1,15),(905,1,13),(904,1,12),(903,1,11),(902,1,40),(901,1,19),(900,1,49),(899,1,48),(898,1,47),(897,1,46),(896,1,8),(895,1,20),(894,1,7),(893,1,5),(483,2,20),(484,2,8),(485,2,19),(892,1,6),(891,1,45),(890,1,26),(889,1,25),(888,1,24),(887,1,23),(886,1,22),(885,1,43),(884,1,42),(883,1,41),(882,1,39),(881,1,38),(880,1,37),(950,3,19),(949,3,55),(948,3,46),(947,3,8),(946,3,20),(945,3,7),(944,3,5),(943,3,6),(942,3,45),(941,3,26),(940,3,25),(939,3,24),(938,3,23),(937,3,22),(936,3,33),(935,3,2),(934,3,1),(933,3,14),(932,3,9),(879,1,36),(878,1,33),(877,1,4),(876,1,3),(875,1,34),(874,1,2),(873,1,1),(872,1,14),(871,1,35),(870,1,9);

/*Table structure for table `ci_group` */

DROP TABLE IF EXISTS `ci_group`;

CREATE TABLE `ci_group` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(100) DEFAULT '',
  `status` tinyint(1) DEFAULT '1',
  `sort` tinyint(4) DEFAULT NULL,
  `remark` varchar(100) DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

/*Data for the table `ci_group` */

insert  into `ci_group`(`id`,`title`,`status`,`sort`,`remark`) values (1,'安置人口信息',1,4,''),(2,'数据统计',1,6,''),(3,'系统设置',1,7,''),(4,'分布示意图',0,1,''),(5,'安置项目信息',1,3,''),(6,'公示名单信息',0,5,''),(7,'产业公司信息',0,2,''),(8,'咨询师管理',1,2,'');

/*Table structure for table `ci_node` */

DROP TABLE IF EXISTS `ci_node`;

CREATE TABLE `ci_node` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `d` varchar(100) DEFAULT '',
  `c` varchar(100) DEFAULT '',
  `f` varchar(100) DEFAULT '',
  `title` varchar(200) DEFAULT '',
  `remark` varchar(100) DEFAULT '',
  `sort` tinyint(4) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '1',
  `pid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `gid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `d` (`d`) USING BTREE,
  KEY `c` (`c`) USING BTREE,
  KEY `f` (`f`) USING BTREE,
  KEY `status` (`status`) USING BTREE,
  KEY `level` (`level`) USING BTREE,
  KEY `pid` (`pid`) USING BTREE,
  KEY `gid` (`gid`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=56 DEFAULT CHARSET=utf8;

/*Data for the table `ci_node` */

insert  into `ci_node`(`id`,`d`,`c`,`f`,`title`,`remark`,`sort`,`status`,`pid`,`level`,`gid`) values (1,'admin','Member','member_list','安置房申请管理','',1,1,0,1,1),(2,'admin','Statistics','index','按安置项目统计','',1,1,0,1,2),(3,'admin','User','index','用户管理','',1,1,0,1,3),(4,'admin','Role','index','角色管理','',2,1,0,1,3),(5,'admin','Member','member_add','新增','',2,1,1,3,1),(6,'admin','Member','member_show','详情','',1,1,1,3,1),(7,'admin','Member','member_edit','修改','',3,1,1,3,1),(8,'admin','Member','member_del','删除','',5,1,1,3,1),(9,'admin','Map','index','安置分布示意图','',1,1,0,1,4),(10,'admin','Publicity','index','公示名单管理','',1,0,0,1,6),(11,'admin','User','user_add','新增','',2,1,3,3,3),(12,'admin','User','user_edit','修改','',3,1,3,3,3),(13,'admin','User','user_del','删除','',4,1,3,3,3),(14,'admin','Project','index','安置项目管理','',1,1,0,1,5),(15,'admin','Role','role_add','新增','',2,1,4,3,3),(16,'admin','Role','role_edit','修改','',3,1,4,3,3),(17,'admin','Role','role_set','设置权限','',5,1,4,3,3),(18,'admin','Role','role_del','删除','',6,1,4,3,3),(19,'admin','Statistics','pro_tj_data','统计','',1,1,2,3,2),(20,'admin','Member','member_save','保存','',4,1,1,3,1),(21,'admin','Role','role_save','保存','',4,1,4,3,3),(33,'admin','Map','map_data','百度地图数据展示','',1,1,9,3,4),(22,'admin','Project','pro_show','详情','',1,1,14,3,5),(23,'admin','Project','pro_add','新增','',2,1,14,3,5),(24,'admin','Project','pro_edit','修改','',3,1,14,3,5),(25,'admin','Project','pro_save','保存','',4,1,14,3,5),(26,'admin','Project','pro_del','删除','',5,1,14,3,5),(27,'admin','Publicity','pub_add','新增','',1,1,10,3,6),(28,'admin','Publicity','pub_edit','标注','',3,1,10,3,6),(29,'admin','Publicity','pub_save','新增保存','',2,1,10,3,6),(30,'admin','Publicity','pub_edit_save','标注保存','',4,1,10,3,6),(31,'admin','Publicity','pub_del','删除','',5,1,10,3,6),(32,'admin','Publicity','pub_export','导出','',6,1,10,3,6),(34,'admin','Statistics','statistics_member','按安置申请人统计','',2,1,0,1,2),(35,'admin','Company','index','产业公司管理','',1,1,0,1,7),(36,'admin','Company','com_add','新增','',1,1,35,3,7),(37,'admin','Company','com_edit','修改','',2,1,35,3,7),(38,'admin','Company','com_save','保存','',3,1,35,3,7),(39,'admin','Company','com_del','删除','',4,1,35,3,7),(40,'admin','Statistics','mem_tj_data','统计','',1,1,34,3,2),(41,'admin','Company','com_uploadfile','导入','',5,1,35,3,7),(42,'admin','Company','com_uploadfile_save','导入保存','',6,1,35,3,7),(43,'admin','Company','com_export','导出','',7,1,35,3,7),(44,'admin','Company','com_downmbfile','下载模板','',8,1,38,3,7),(45,'admin','Project','pro_export','导出','',6,1,14,3,5),(46,'admin','Member','member_uploadfile','导入','',6,1,1,3,1),(47,'admin','Member','member_uploadfile_save','导入保存','',7,1,1,3,1),(48,'admin','Member','member_export','导出','',8,1,1,3,1),(49,'admin','Member','member_downmbfile','下载模板','',9,1,1,3,1),(50,'admin','Therapist','index','管理咨询师','',1,1,0,1,8),(51,'admin','Address','town_add','乡镇新增','',2,1,50,3,8),(52,'admin','Address','village_add','行政村新增','',3,1,50,3,8),(53,'admin','Address','address_edit','行政村修改','',4,1,50,3,8),(54,'admin','Address','address_del','地址删除','',5,1,50,3,8),(55,'admin','Member','check_member','审核申请','',6,1,1,3,1);

/*Table structure for table `ci_role` */

DROP TABLE IF EXISTS `ci_role`;

CREATE TABLE `ci_role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(60) DEFAULT '',
  `status` tinyint(1) DEFAULT '1',
  `remark` varchar(100) DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

/*Data for the table `ci_role` */

insert  into `ci_role`(`id`,`name`,`status`,`remark`) values (1,'超级管理员',1,''),(2,'普通管理员',1,''),(3,'录入员',1,'1111133');

/*Table structure for table `consultant_type` */

DROP TABLE IF EXISTS `consultant_type`;

CREATE TABLE `consultant_type` (
  `id` int(5) NOT NULL AUTO_INCREMENT,
  `title` varchar(20) NOT NULL DEFAULT '' COMMENT '名称',
  `sort` int(3) NOT NULL DEFAULT '0' COMMENT '排序',
  `addtime` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `consultant_type` */

insert  into `consultant_type`(`id`,`title`,`sort`,`addtime`) values (1,'婚恋情感',0,0),(2,'亲子',0,0),(3,'人际关系',0,0),(4,'职场',0,0),(5,'自我认知',0,0),(6,'抑郁症',0,0);

/*Table structure for table `therapist` */

DROP TABLE IF EXISTS `therapist`;

CREATE TABLE `therapist` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(15) NOT NULL DEFAULT '' COMMENT '姓名',
  `sex` tinyint(1) NOT NULL DEFAULT '0' COMMENT '性别',
  `birth` varchar(20) NOT NULL DEFAULT '' COMMENT '出生年月',
  `good_at_type_ids` varchar(30) NOT NULL DEFAULT '' COMMENT '擅长的类型的id',
  `certificate_type` varchar(30) NOT NULL DEFAULT '' COMMENT '证书类型',
  `certificate_title` varchar(30) NOT NULL DEFAULT '' COMMENT '证书名称',
  `info` varchar(1024) NOT NULL DEFAULT '' COMMENT '简介',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否认证',
  `experience` varchar(512) NOT NULL DEFAULT '' COMMENT '经历',
  `points` int(3) NOT NULL DEFAULT '0' COMMENT '积分',
  `addtime` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=258 DEFAULT CHARSET=utf8;

/*Data for the table `therapist` */

insert  into `therapist`(`id`,`name`,`sex`,`birth`,`good_at_type_ids`,`certificate_type`,`certificate_title`,`info`,`status`,`experience`,`points`,`addtime`) values (1,'张三1',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(2,'张三2',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(4,'张三4',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(5,'张三5',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(6,'张三6',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(7,'张三7',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(8,'张三8',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(9,'张三9',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(10,'张三10',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(11,'张三11',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(12,'张三12',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(13,'张三13',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(14,'张三14',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(15,'张三15',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(16,'张三16',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(17,'张三17',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(18,'张三18',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(19,'张三19',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(20,'张三20',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(21,'张三21',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(22,'张三22',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(23,'张三23',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(24,'张三24',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(25,'张三25',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(26,'张三26',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(27,'张三27',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(28,'张三28',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(29,'张三29',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(30,'张三30',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(31,'张三31',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(32,'张三32',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(33,'张三33',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(34,'张三34',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(35,'张三35',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(36,'张三36',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(37,'张三37',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(38,'张三38',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(39,'张三39',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(40,'张三40',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(41,'张三41',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(42,'张三42',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(43,'张三43',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(44,'张三44',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(45,'张三45',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(46,'张三46',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(47,'张三47',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(48,'张三48',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(49,'张三49',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(50,'张三50',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(51,'张三51',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(52,'张三52',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(53,'张三53',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(54,'张三54',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(55,'张三55',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(56,'张三56',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(57,'张三57',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(58,'张三58',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(59,'张三59',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(60,'张三60',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(61,'张三61',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(62,'张三62',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(63,'张三63',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(64,'张三64',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(65,'张三65',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(66,'张三66',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(67,'张三67',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(68,'张三68',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(69,'张三69',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(70,'张三70',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(71,'张三71',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(72,'张三72',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(73,'张三73',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(74,'张三74',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(75,'张三75',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(76,'张三76',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(77,'张三77',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(78,'张三78',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(79,'张三79',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(80,'张三80',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(81,'张三81',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(82,'张三82',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(83,'张三83',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(84,'张三84',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(85,'张三85',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(86,'张三86',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(87,'张三87',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(88,'张三88',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(89,'张三89',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(90,'张三90',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(91,'张三91',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(92,'张三92',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(93,'张三93',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(94,'张三94',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(95,'张三95',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(96,'张三96',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(97,'张三97',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(98,'张三98',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(99,'张三99',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(100,'张三100',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(101,'张三101',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(102,'张三102',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(103,'张三103',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(104,'张三104',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(105,'张三105',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(106,'张三106',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(107,'张三107',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(108,'张三108',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(109,'张三109',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(110,'张三110',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(111,'张三111',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(112,'张三112',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(113,'张三113',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(114,'张三114',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(115,'张三115',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(116,'张三116',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(117,'张三117',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(118,'张三118',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(119,'张三119',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(120,'张三120',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(121,'张三121',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(122,'张三122',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(123,'张三123',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(124,'张三124',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(125,'张三125',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(126,'张三126',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(127,'张三127',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(128,'张三128',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(129,'张三129',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(130,'张三130',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(131,'张三131',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(132,'张三132',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(133,'张三133',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(134,'张三134',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(135,'张三135',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(136,'张三136',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(137,'张三137',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(138,'张三138',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(139,'张三139',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(140,'张三140',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(141,'张三141',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(142,'张三142',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(143,'张三143',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(144,'张三144',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(145,'张三145',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(146,'张三146',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(147,'张三147',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(148,'张三148',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(149,'张三149',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(150,'张三150',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(151,'张三151',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(152,'张三152',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(153,'张三153',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(154,'张三154',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(155,'张三155',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(156,'张三156',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(157,'张三157',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(158,'张三158',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(159,'张三159',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(160,'张三160',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(161,'张三161',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(162,'张三162',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(163,'张三163',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(164,'张三164',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(165,'张三165',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(166,'张三166',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(167,'张三167',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(168,'张三168',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(169,'张三169',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(170,'张三170',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(171,'张三171',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(172,'张三172',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(173,'张三173',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(174,'张三174',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(175,'张三175',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(176,'张三176',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(177,'张三177',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(178,'张三178',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(179,'张三179',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(180,'张三180',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(181,'张三181',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(182,'张三182',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(183,'张三183',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(184,'张三184',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(185,'张三185',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(186,'张三186',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(187,'张三187',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(188,'张三188',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(189,'张三189',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(190,'张三190',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(191,'张三191',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(192,'张三192',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(193,'张三193',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(194,'张三194',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(195,'张三195',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(196,'张三196',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(197,'张三197',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(198,'张三198',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(199,'张三199',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(200,'张三200',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(201,'张三201',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(202,'张三202',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(203,'张三203',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(204,'张三204',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(205,'张三205',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(206,'张三206',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(207,'张三207',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(208,'张三208',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(209,'张三209',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(210,'张三210',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(211,'张三211',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(212,'张三212',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(213,'张三213',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(214,'张三214',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(215,'张三215',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(216,'张三216',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(217,'张三217',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(218,'张三218',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(219,'张三219',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(220,'张三220',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(221,'张三221',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(222,'张三222',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(223,'张三223',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(224,'张三224',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(225,'张三225',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(226,'张三226',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(227,'张三227',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(228,'张三228',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(229,'张三229',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(230,'张三230',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(231,'张三231',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(232,'张三232',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(233,'张三233',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(236,'张三236',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(237,'张三237',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(238,'张三238',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(239,'张三239',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(240,'张三240',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(241,'张三241',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(242,'张三242',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(243,'张三243',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(244,'张三244',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(245,'张三245',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(246,'张三246',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(247,'张三247',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(248,'张三248',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(249,'张三249',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(250,'张三250',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(251,'张三251',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(252,'张三252',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(253,'张三253',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0),(254,'张三254',0,'1990-06-12','5','职称类','心理咨询师','简介',1,'心理老师培训',80,0),(255,'张三255',1,'1992-11-07','5,4,3','无2','无2','无2',0,'无2',89,0);

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `act_type` int(1) DEFAULT '0' COMMENT '账号类型1超级管理员2分支管理员',
  `department` varchar(120) DEFAULT '' COMMENT '所属部门',
  `username` varchar(60) DEFAULT '' COMMENT '用户名',
  `nickname` varchar(120) DEFAULT '' COMMENT '昵称',
  `password` varchar(40) DEFAULT '' COMMENT '密码',
  `token` varchar(50) DEFAULT '' COMMENT 'token',
  `ip` varchar(20) DEFAULT '' COMMENT 'IP',
  `lastlogin_time` int(10) DEFAULT NULL COMMENT '最后登录时间',
  `beizhu` varchar(200) DEFAULT '' COMMENT '备注',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1为禁用',
  `create_time` int(10) DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`) USING BTREE,
  KEY `act_type` (`act_type`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='管理员用户表';

/*Data for the table `user` */

insert  into `user`(`id`,`act_type`,`department`,`username`,`nickname`,`password`,`token`,`ip`,`lastlogin_time`,`beizhu`,`status`,`create_time`) values (1,1,'超级管理员','admin','超级管理员','9bad2764044171acdab696d32fb4c16d','f8b5bcf1d7f145bfd6dc6e835e3e69d1','127.0.0.1',1510034068,'',0,0),(3,3,'测试','admin1','123456','9bad2764044171acdab696d32fb4c16d','','127.0.0.1',1510020409,'123456',0,0);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
